src/DataProcessors/onyx_ПомощникПервогоЗапуска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>onyx_ПомощникПервогоЗапуска</Name>
			<Comment>Мастер первоначальной настройки подключения к API Onyx</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/onyx_НастройкиAPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>onyx_НастройкиAPI</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>APIКлюч</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БазовыйURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТаймаутСоединения</Name>
					<Comment>Таймаут соединения (секунды)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТаймаутЧтения</Name>
					<Comment>Таймаут чтения (секунды)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальноеКоличествоПовторов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальноеВремяПовторов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнегоОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контур</Name>
					<Type>
						<v8:Type>cfg:EnumRef.onyx_КонтурAPI</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/onyx_КонтурAPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>onyx_КонтурAPI</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РабочийКонтур</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТестовыйКонтур</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/onyx_ПомощникПервогоЗапуска/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиФормы

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Инициализация данных формы (включает установку ТекущаяСтраница = 1)
	ИнициализироватьДанныеФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Убеждаемся, что текущая страница установлена
	Если НЕ ЗначениеЗаполнено(ТекущаяСтраница) ИЛИ ТекущаяСтраница < 1 ИЛИ ТекущаяСтраница > 2 Тогда
		ТекущаяСтраница = 1;
	КонецЕсли;
	
	// Обновляем навигацию и видимость страниц
	ОбновитьНавигацию();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

////////////////////////////////////////////////////////////////////////////////
// Обработчики команд формы

&НаКлиенте
Процедура КнопкаНазад(Команда)
	
	Если ТекущаяСтраница <= 1 Тогда
		Возврат;
	КонецЕсли;
	
	ПерейтиНаСтраницу(ТекущаяСтраница - 1);
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаДалее(Команда)
	
	Если ТекущаяСтраница = 1 Тогда
		// Страница 1: валидация настроек и проверка соединения
		Если НЕ ВалидироватьНастройкиПодключения() Тогда
			Возврат;
		КонецЕсли;
		
		// Проверка соединения обязательна перед переходом
		Если НЕ ПроверкаСоединенияВыполнена Тогда
		СообщитьПользователю(НСтр("ru='Необходимо проверить соединение перед продолжением.'"));
		Попытка
			Элементы.ПроверитьСоединение.УстановитьФокус();
		Исключение
			// Игнорируем ошибки установки фокуса - элемент может не существовать или быть недоступен.
			// Логирование недоступно в клиентском коде, ошибка не критична.
			ИгнорируемОшибку = Истина;
		КонецПопытки;
			Возврат;
		КонецЕсли;
		
		// Переход на страницу 2
		ПерейтиНаСтраницу(2);
		
	ИначеЕсли ТекущаяСтраница = 2 Тогда
		// Страница 2: загрузка агентов завершена, сохраняем настройки
		КнопкаГотово(Команда);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОтмена(Команда)
	
	СообщениеПодтверждения = НСтр("ru='Вы действительно хотите закрыть помощник настройки без сохранения изменений?'");
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОтмены", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, СообщениеПодтверждения, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОтмены(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаГотово(Команда)
	
	// На странице 2 перед сохранением нужно загрузить агентов (если еще не загружены)
	Если ТекущаяСтраница = 2 И НЕ АгентыЗагружены Тогда
		СообщитьПользователю(НСтр("ru='Необходимо загрузить агентов перед завершением настройки.'"));
		Возврат;
	КонецЕсли;
	
	СохранитьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьАгентов(Команда)
	
	// Безопасное получение элемента кнопки (может иметь другое имя)
	Попытка
		ЭлементКнопки = Элементы.Найти("ЗагрузитьАгентов");
	Если ЭлементКнопки <> Неопределено Тогда
		ЭлементКнопки.Доступность = Ложь;
	КонецЕсли;
Исключение
	// Элемент кнопки может не существовать.
	// Логирование недоступно в клиентском коде, ошибка не критична.
	ИгнорируемОшибку = Истина;
КонецПопытки;
	
	Попытка
		
		Результат = ЗагрузитьАгентовНаСервере();
		
		// Проверка корректности результата
		Если ТипЗнч(Результат) <> Тип("Структура") Тогда
			ПоказатьПредупреждение(, "Ошибка: некорректный результат загрузки агентов");
			Возврат;
		КонецЕсли;
		
		Если НЕ Результат.Свойство("Успех") Тогда
			ПоказатьПредупреждение(, "Ошибка: результат не содержит признака успеха");
			Возврат;
		КонецЕсли;
		
		Успех = Результат.Успех;
		
		Если Успех Тогда
			АгентыЗагружены = Истина;
			
		// Обновление динамического списка агентов
		Попытка
			Элементы.Агенты.Обновить();
		Исключение
			// Элемент списка может не существовать или уже обновлен автоматически.
			// Логирование недоступно в клиентском коде, ошибка не критична.
			ИгнорируемОшибку = Истина;
		КонецПопытки;
			
			ОбновитьНавигацию(); // Обновляем навигацию, чтобы включить кнопку "Готово"
			
		Иначе
			// Безопасное получение сообщения об ошибке
			ТекстОшибки = "";
			Если Результат.Свойство("Сообщение") Тогда
				ТекстОшибки = Результат.Сообщение;
			ИначеЕсли Результат.Свойство("ТекстОшибки") Тогда
				ТекстОшибки = Результат.ТекстОшибки;
			Иначе
				ТекстОшибки = "Произошла ошибка при загрузке агентов";
			КонецЕсли;
			
			ПоказатьПредупреждение(, ТекстОшибки);
		КонецЕсли;
		
	Исключение
		
		ТекстОшибки = "Ошибка при загрузке агентов: " + ОписаниеОшибки();
		ПоказатьПредупреждение(, ТекстОшибки);
		
	КонецПопытки;
	
	// Восстановление доступности кнопки
	Попытка
		ЭлементКнопки = Элементы.Найти("ЗагрузитьАгентов");
	Если ЭлементКнопки <> Неопределено Тогда
		ЭлементКнопки.Доступность = Истина;
	КонецЕсли;
Исключение
	// Элемент кнопки может не существовать.
	// Логирование недоступно в клиентском коде, ошибка не критична.
	ИгнорируемОшибку = Истина;
КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоединение(Команда)
	
	Попытка
		Элементы.ПроверитьСоединение.Доступность = Ложь;
		СообщениеПроверкиСоединения = "";
		
		Результат = ПроверитьСоединениеНаСервере();
		
		// Проверка корректности результата
		Если ТипЗнч(Результат) <> Тип("Структура") Тогда
			СообщениеПроверкиСоединения = "Ошибка при получении результата проверки соединения";
			ПроверкаСоединенияВыполнена = Ложь;
			ПоказатьПредупреждение(, СообщениеПроверкиСоединения);
			Элементы.ПроверитьСоединение.Доступность = Истина;
			Возврат;
		КонецЕсли;
		
		Если НЕ Результат.Свойство("Успех") Тогда
			СообщениеПроверкиСоединения = "Ошибка при получении результата проверки соединения";
			ПроверкаСоединенияВыполнена = Ложь;
			ПоказатьПредупреждение(, СообщениеПроверкиСоединения);
			Элементы.ПроверитьСоединение.Доступность = Истина;
			Возврат;
		КонецЕсли;
		
		Успех = Результат.Успех;
		
		Если Успех Тогда
			Если Результат.Свойство("Сообщение") Тогда
				СообщениеПроверкиСоединения = Результат.Сообщение;
			Иначе
				СообщениеПроверкиСоединения = "Соединение установлено успешно";
			КонецЕсли;
			ПроверкаСоединенияВыполнена = Истина;
			ОбновитьНавигацию(); // Обновляем навигацию, чтобы включить кнопку "Далее"
			
			// Автоматическое сохранение настроек после успешной проверки соединения
			СохранитьНастройкиПослеПроверкиСоединения();
			
		Иначе
			Если Результат.Свойство("Сообщение") Тогда
				СообщениеПроверкиСоединения = Результат.Сообщение;
			ИначеЕсли Результат.Свойство("ТекстОшибки") Тогда
				СообщениеПроверкиСоединения = Результат.ТекстОшибки;
			Иначе
				СообщениеПроверкиСоединения = "Произошла ошибка при проверке соединения";
			КонецЕсли;
			Если Результат.Свойство("КодОшибки") Тогда
				КодОшибкиПроверки = Строка(Результат.КодОшибки);
			КонецЕсли;
			ПроверкаСоединенияВыполнена = Ложь;
			ПоказатьПредупреждение(, СообщениеПроверкиСоединения);
		КонецЕсли;
	Исключение
		СообщениеПроверкиСоединения = "Ошибка при проверке соединения: " + ОписаниеОшибки();
		ПроверкаСоединенияВыполнена = Ложь;
		ПоказатьПредупреждение(, СообщениеПроверкиСоединения);
	КонецПопытки;
	
	Элементы.ПроверитьСоединение.Доступность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииФормы

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции формы

&НаСервере
Процедура ИнициализироватьДанныеФормы()
	
	// Инициализация значений по умолчанию
	Если НЕ ЗначениеЗаполнено(Контур) Тогда
		// Проверяем значение из константы
		Контур = Перечисления.onyx_КонтурAPI.РабочийКонтур;
	КонецЕсли;
	
	// URL не заполняется автоматически - пользователь должен указать его вручную
	
	Если НЕ ЗначениеЗаполнено(ТаймаутСоединения) Тогда
		ТаймаутСоединения = 300;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТаймаутЧтения) Тогда
		ТаймаутЧтения = 60;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(МаксимальноеКоличествоПовторов) Тогда
		МаксимальноеКоличествоПовторов = 3;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(МаксимальноеВремяПовторов) Тогда
		МаксимальноеВремяПовторов = 5;
	КонецЕсли;
	
	// Инициализация статусов
	СообщениеПроверкиСоединения = "";
	
	// Инициализация статусов загрузки агентов
	АгентыЗагружены = Ложь;
	
	// Инициализация текущей страницы
	ТекущаяСтраница = 1;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаСтраницу(НомерСтраницы)
	
	// Мастер работает только с 2 страницами
	Если НомерСтраницы < 1 ИЛИ НомерСтраницы > 2 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтраница = НомерСтраницы;
	ОбновитьНавигацию();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНавигацию()
	
	// Проверка корректности текущей страницы
	Если НЕ ЗначениеЗаполнено(ТекущаяСтраница) ИЛИ ТекущаяСтраница < 1 ИЛИ ТекущаяСтраница > 2 Тогда
		ТекущаяСтраница = 1;
	КонецЕсли;
	
	// Управление текущей страницей через свойство ТекущаяСтраница элемента "Страницы"
	Попытка
		Если ТекущаяСтраница = 1 Тогда
			// Страница 1: Настройка подключения и проверка соединения
			Элементы.Страницы.ТекущаяСтраница = Элементы.Страница_НастройкаПодключения;
		ИначеЕсли ТекущаяСтраница = 2 Тогда
		// Страница 2: Загрузка агентов
		Элементы.Страницы.ТекущаяСтраница = Элементы.Страница_ЗагрузкаАгентов;
	КонецЕсли;
Исключение
	// Элементы страниц могут не существовать или форма еще не полностью загружена.
	// Это нормально при первой инициализации.
	// Логирование недоступно в клиентском коде, ошибка не критична.
	ИгнорируемОшибку = Истина;
КонецПопытки;
	
	// Управление доступностью кнопки "Назад"
	Элементы.КнопкаНазад.Видимость = (ТекущаяСтраница > 1);
	Элементы.КнопкаНазад.Доступность = (ТекущаяСтраница > 1);
	
	// Управление кнопкой "Далее" и "Готово"
	Если ТекущаяСтраница = 1 Тогда
		// На странице 1 показываем "Далее"
		Элементы.КнопкаДалее.Видимость = Истина;
		Элементы.КнопкаДалее.Доступность = ПроверкаСоединенияВыполнена;
		Элементы.КнопкаГотово.Видимость = Ложь;
	ИначеЕсли ТекущаяСтраница = 2 Тогда
		// На странице 2 показываем "Готово" вместо "Далее"
		Элементы.КнопкаДалее.Видимость = Ложь;
		Элементы.КнопкаГотово.Видимость = Истина;
		Элементы.КнопкаГотово.Доступность = АгентыЗагружены;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ВалидироватьТекущуюСтраницу()
	
	// Валидация страницы 1 (настройка подключения)
	Если ТекущаяСтраница = 1 Тогда
		Возврат ВалидироватьНастройкиПодключения();
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ВалидироватьНастройкиПодключения()
	
	Если НЕ ЗначениеЗаполнено(Контур) Тогда
		ПоказатьПредупреждение(, НСтр("ru='Необходимо выбрать контур API.'"));
		Элементы.Контур.УстановитьФокус();
		Возврат Ложь;
	КонецЕсли;
	
	Если ПустаяСтрока(APIКлюч) Тогда
		ПоказатьПредупреждение(, НСтр("ru='Необходимо ввести API ключ.'"));
		Элементы.APIКлюч.УстановитьФокус();
		Возврат Ложь;
	КонецЕсли;
	
	Если СтрДлина(APIКлюч) < 10 Тогда
		ПоказатьПредупреждение(, НСтр("ru='API ключ слишком короткий. Минимальная длина: 10 символов.'"));
		Элементы.APIКлюч.УстановитьФокус();
		Возврат Ложь;
	КонецЕсли;
	
	Если ПустаяСтрока(БазовыйURL) Тогда
		ПоказатьПредупреждение(, НСтр("ru='Необходимо указать базовый URL.'"));
		Элементы.БазовыйURL.УстановитьФокус();
		Возврат Ложь;
	КонецЕсли;
	
	// Проверка формата URL
	Если НЕ СтрНачинаетсяС(БазовыйURL, "http://") И НЕ СтрНачинаетсяС(БазовыйURL, "https://") Тогда
		ПоказатьПредупреждение(, НСтр("ru='Базовый URL должен начинаться с http:// или https://'"));
		Элементы.БазовыйURL.УстановитьФокус();
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ПроверитьСоединениеНаСервере()
	
	Попытка
		
		// Получение настроек из формы
		Настройки = ПолучитьНастройкиИзФормы();
		
		// Выполнение Health Check запроса
		ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
		Результат = ВыполнитьHealthCheck(Настройки);
		
		ВремяОкончания = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ВремяОткликаМс = ВремяОкончания - ВремяНачала;
		
		// Проверка корректности результата
		Если ТипЗнч(Результат) <> Тип("Структура") Тогда
			Возврат Новый Структура(
				"Успех", Ложь,
				"Сообщение", "Ошибка: некорректный результат проверки соединения",
				"КодОшибки", 0
			);
		КонецЕсли;
		
		Если НЕ Результат.Свойство("Успех") Тогда
			ТекстОшибки = "Ошибка: результат проверки не содержит признака успеха";
			Если Результат.Свойство("ТекстОшибки") Тогда
				ТекстОшибки = Результат.ТекстОшибки;
			ИначеЕсли Результат.Свойство("Сообщение") Тогда
				ТекстОшибки = Результат.Сообщение;
			КонецЕсли;
			Возврат Новый Структура(
				"Успех", Ложь,
				"Сообщение", ТекстОшибки,
				"КодОшибки", 0
			);
		КонецЕсли;
		
		Успех = Результат.Успех;
		
		Если Успех Тогда
			Возврат Новый Структура(
				"Успех", Истина,
				"Сообщение", "Соединение установлено успешно",
				"КодОшибки", 0
			);
		Иначе
			// Получаем текст ошибки из результата
			ТекстОшибки = "";
			Если Результат.Свойство("ТекстОшибки") Тогда
				ТекстОшибки = Результат.ТекстОшибки;
			ИначеЕсли Результат.Свойство("Сообщение") Тогда
				ТекстОшибки = Результат.Сообщение;
			Иначе
				ТекстОшибки = "Произошла ошибка при проверке соединения";
			КонецЕсли;
			
			КодОшибки = 0;
			Если Результат.Свойство("КодОшибки") Тогда
				КодОшибки = Результат.КодОшибки;
			КонецЕсли;
			
			Возврат Новый Структура(
				"Успех", Ложь,
				"Сообщение", ТекстОшибки,
				"КодОшибки", КодОшибки
			);
		КонецЕсли;
		
	Исключение
		
		Возврат Новый Структура(
			"Успех", Ложь,
			"Сообщение", "Ошибка при проверке соединения: " + ОписаниеОшибки(),
			"КодОшибки", 0
		);
		
	КонецПопытки;
	
КонецФункции

&НаСервере
Функция ВыполнитьHealthCheck(Настройки)
	
	Попытка
		
		// Подготовка URL для Health Check
		БазовыйURL = Настройки.БазовыйURL;
		Если НЕ СтрЗаканчиваетсяНа(БазовыйURL, "/") Тогда
			БазовыйURL = БазовыйURL + "/";
		КонецЕсли;
		
		URLЗапроса = БазовыйURL + "health";
		
		// Создание HTTP-сессии
		Сессия = onyx_КоннекторHTTP.СоздатьСессию();
		
		// Подготовка заголовков
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type", "application/json");
		Заголовки.Вставить("Accept", "application/json");
		Сессия.Заголовки = Заголовки;
		
		// Подготовка параметров запроса
		ДополнительныеПараметры = onyx_КоннекторHTTP.НовыеПараметры();
		Если ЗначениеЗаполнено(Настройки.ТаймаутСоединения) Тогда
			ДополнительныеПараметры.Таймаут = Настройки.ТаймаутСоединения;
		Иначе
			ДополнительныеПараметры.Таймаут = 30;
		КонецЕсли;
		ДополнительныеПараметры.Аутентификация = onyx_КоннекторHTTP.НоваяАутентификацияBearer(Настройки.APIКлюч);
		
		// Выполнение GET запроса
		Ответ = onyx_КоннекторHTTP.Get(URLЗапроса, Неопределено, ДополнительныеПараметры, Сессия);
		
		// Проверка корректности ответа
		Если ТипЗнч(Ответ) <> Тип("Структура") Тогда
			Возврат Новый Структура("Успех", Ложь, "ТекстОшибки", "Некорректный ответ от сервера", "КодОшибки", 0);
		КонецЕсли;
		
		Если НЕ Ответ.Свойство("КодСостояния") Тогда
			Возврат Новый Структура("Успех", Ложь, "ТекстОшибки", "Ответ не содержит код состояния", "КодОшибки", 0);
		КонецЕсли;
		
		КодСостояния = Ответ.КодСостояния;
		
		Если КодСостояния = 200 Тогда
			// Успешный ответ
			Возврат Новый Структура("Успех", Истина, "ТекстОшибки", "", "КодОшибки", 0);
		ИначеЕсли КодСостояния = 401 Тогда
			// Ошибка авторизации
			Возврат Новый Структура("Успех", Ложь, "ТекстОшибки", "Неверный API ключ. Проверьте правильность ключа.", "КодОшибки", 401);
		ИначеЕсли КодСостояния >= 500 Тогда
			// Ошибка сервера
			Возврат Новый Структура("Успех", Ложь, "ТекстОшибки", "Сервер Onyx временно недоступен. Попробуйте позже.", "КодОшибки", КодСостояния);
		Иначе
			// Другая ошибка
			ТекстОшибки = "Ошибка соединения. HTTP код: " + КодСостояния;
			Возврат Новый Структура("Успех", Ложь, "ТекстОшибки", ТекстОшибки, "КодОшибки", КодСостояния);
		КонецЕсли;
		
	Исключение
		
		ТекстОшибки = "Не удалось установить соединение с сервером Onyx: " + ОписаниеОшибки();
		Возврат Новый Структура("Успех", Ложь, "ТекстОшибки", ТекстОшибки, "КодОшибки", 0);
		
	КонецПопытки;
	
КонецФункции

&НаСервере
Функция ПолучитьНастройкиИзФормы()
	
	Настройки = Новый Структура;
	Настройки.Вставить("Контур", Контур);
	Настройки.Вставить("APIКлюч", APIКлюч);
	Настройки.Вставить("БазовыйURL", БазовыйURL);
	Настройки.Вставить("ТаймаутСоединения", ТаймаутСоединения);
	Настройки.Вставить("ТаймаутЧтения", ТаймаутЧтения);
	Настройки.Вставить("МаксимальноеКоличествоПовторов", МаксимальноеКоличествоПовторов);
	Настройки.Вставить("МаксимальноеВремяПовторов", МаксимальноеВремяПовторов);
	
	Возврат Настройки;
	
КонецФункции

&НаКлиенте
Процедура СохранитьНастройки()
	
	Попытка
		
		Результат = СохранитьНастройкиНаСервере();
		
		Если Результат.Успех Тогда
			Закрыть();
		Иначе
			ТекстОшибки = "";
			Если Результат.Свойство("ТекстОшибки") Тогда
				ТекстОшибки = Результат.ТекстОшибки;
			ИначеЕсли Результат.Свойство("Сообщение") Тогда
				ТекстОшибки = Результат.Сообщение;
			Иначе
				ТекстОшибки = "Произошла ошибка при сохранении настроек";
			КонецЕсли;
			ПоказатьПредупреждение(, ТекстОшибки);
		КонецЕсли;
		
	Исключение
		
		ТекстОшибки = "Ошибка при сохранении настроек: " + ОписаниеОшибки();
		ПоказатьПредупреждение(, ТекстОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиПослеПроверкиСоединения()
	
	Попытка
		СохранитьНастройкиНаСервере();
	Исключение
		// Ошибка сохранения не критична, пользователь может сохранить вручную позже.
		// Логирование недоступно в клиентском коде, ошибка не критична.
		ИгнорируемОшибку = Истина;
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция СохранитьНастройкиНаСервере()
	
	Попытка
		
		Настройки = ПолучитьНастройкиИзФормы();
		
		// Сохранение выбранного контура в константу перед сохранением в регистр
		Если ЗначениеЗаполнено(Настройки.Контур) Тогда
			Константы.onyx_ТекущийКонтурAPI.Установить(Настройки.Контур);
		КонецЕсли;
		
		// Используем менеджер регистра для записи настроек
		Возврат РегистрыСведений.onyx_НастройкиAPI.ЗаписатьНастройки(Настройки);
		
	Исключение
		
		ТекстОшибки = "Не удалось сохранить настройки: " + ОписаниеОшибки();
		Возврат Новый Структура("Успех", Ложь, "ТекстОшибки", ТекстОшибки);
		
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Процедура СообщитьПользователю(ТекстСообщения)
	
	Если ПустаяСтрока(ТекстСообщения) Тогда
		Возврат;
	КонецЕсли;
	
	Сообщить(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьУведомлениеНаКлиенте(ТекстСообщения)
	
	СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОшибкуНаКлиенте(ТекстОшибки)
	
	ПоказатьПредупреждение(, ТекстОшибки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму()
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьАгентовНаСервере()
	
	Попытка
		
		// Загрузка агентов из API
		СсылкиНаАгентов = onyx_РаботаСАгентами.ПолучитьСписокАгентов(Истина); // ОбновитьКэш = Истина
		
		КоличествоЗагружено = СсылкиНаАгентов.Количество();
		
		Если КоличествоЗагружено = 0 Тогда
			Возврат Новый Структура(
				"Успех", Истина,
				"Сообщение", НСтр("ru='Агенты не найдены в вашем аккаунте Onyx. Вы можете создать их на сайте Onyx.'")
			);
		КонецЕсли;
		
		Возврат Новый Структура(
			"Успех", Истина,
			"Сообщение", СтрШаблон(НСтр("ru='Успешно загружено агентов: %1'"), КоличествоЗагружено)
		);
		
	Исключение
		
		ТекстОшибки = "Ошибка при загрузке агентов: " + ОписаниеОшибки();
		Возврат Новый Структура(
			"Успех", Ложь,
			"Сообщение", ТекстОшибки
		);
		
	КонецПопытки;
	
КонецФункции

#КонецОбласти
